app/Controllers/CarritoController.php

SELECT *
FROM `productos`
WHERE `id_producto` = '13'
 LIMIT 1
---
    public function agregar_carrito()
    {
        $cart = \Config\Services::cart();
        $request = \Config\Services::request();
        $productos = new ProductoModel();

        $id_producto = $request->getPost('id_producto');
        $nombre = $request->getPost('nombre');
        $precio = $request->getPost('precio');

        // Verificar que el producto existe y tiene stock
        $producto = $productos->where('id_producto', $id_producto)->first();