app/Controllers/ProductoController.php

    public function gestionar_productos()
    {
        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaProductoModel();
        $data['productos'] = $productoModel->join('producto_categoria', 'producto_categoria.id_categoria = productos.producto_categoria')->findAll();
---
SELECT *
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`id_categoria` = `productos`.`producto_categoria`

    public function editar_producto($id = null)
    {

        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaProductoModel();
        $data['categorias'] = $categoriaModel->findAll();
        $data['producto'] = $productoModel->where('id_producto', $id)->first();
---
SELECT *
FROM `productos`
WHERE `id_producto` = '5'
 LIMIT 1

        }

        // Actualizamos en la base de datos
        $productoModel->update($id, $data);
---
UPDATE `productos` SET `nombre` = 'Mouse', `descripcion` = 'Mouse Gamer2', `precio` = '10000', `stock` = '3', `producto_categoria` = '1', `imagen` = '1750384566_f8a93a24a4cfa5bc7274.webp'
WHERE `productos`.`id_producto` IN ('3')

    public function listar_productos()
    {
        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaProductoModel();

        // Obtener parámetros de la URL
        $buscar = $this->request->getGet('buscar');
        $categoria = $this->request->getGet('categoria');
        $orden_precio = $this->request->getGet('orden_precio');

        // Construir la consulta
        $builder = $productoModel->select('productos.*, producto_categoria.categoria_descripcion as categoria_descripcion')
            ->join('producto_categoria', 'producto_categoria.id_categoria = productos.producto_categoria')
            ->where('productos.producto_estado', 1);

        if ($buscar) {
            $builder->like('productos.nombre', $buscar);
        }

        if ($categoria) {
            $builder->where('productos.producto_categoria', $categoria);
        }

        if ($orden_precio === 'asc' || $orden_precio === 'desc') {
            $builder->orderBy('productos.precio', $orden_precio);
        } else {
            $builder->orderBy('productos.nombre', 'asc');
        }

        // Obtener resultados
        $data['producto'] = $builder->findAll();
---
SELECT *
FROM `producto_categoria`
SELECT `productos`.*, `producto_categoria`.`categoria_descripcion` as `categoria_descripcion`
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`id_categoria` = `productos`.`producto_categoria`
WHERE `productos`.`producto_estado` = 1
ORDER BY `productos`.`nombre` ASC