app/Controllers/ProductoController.php

INSERT INTO `productos` (`nombre`, `descripcion`, `precio`, `stock`, `imagen`, `producto_categoria`, `producto_estado`) VALUES ('Cocina', 'cocina escorial negra', '150.000', '20', '1748958120_65510846f64772b5b977.jpg', '1', 1)
---
            ];

            $producto = new ProductoModel();
            $producto->insert($data);