app/Controllers/VentasController.php

SELECT *
FROM `venta`
WHERE `id_cliente` = '24'
SELECT *
FROM `detalle_venta`
WHERE `venta_id` = '38'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '13'
---
    public function mis_compras()
    {
        $session = session();
        if (!$session->get('login')) {
            return redirect()->to('login')->with('mensaje_error', 'Debe iniciar sesión para ver sus compras.');
        }


        $idCliente = $session->get('id');
        $ventaModel = new VentaModel();
        $detalleVentaModel = new DetalleVentaModel();
        $productoModel = new ProductoModel();

        $ventas = $ventaModel->where('id_cliente', $idCliente)->findAll();

        $compras = [];
        foreach ($ventas as $venta) {
            $detalles = $detalleVentaModel
                ->where('venta_id', $venta['id_venta'])
                ->findAll();

            $total = 0;
            foreach ($detalles as &$detalle) {
                $producto = $productoModel->find($detalle['id_producto']);